<?php

declare(strict_types=1);

/**
 * アーカイブとユーザー情報を紐付けするためのIIMS活動歴マスタ
 */
return [
    // ぐんま
    '多文化ぐんま' => [
        'g_2011_sum' => '多文化ぐんま2011夏',
        'g_2012_sum' => '多文化ぐんま2012夏',
        'g_2013_sum' => '多文化ぐんま2013夏',
        'g_2014_win' => '多文化ぐんま2014冬',
        'g_2014_sum' => '多文化ぐんま2014夏',
        'g_2015_win' => '多文化ぐんま2015冬',
        'g_2015_sum' => '多文化ぐんま2015夏',
        'g_2016_win' => '多文化ぐんま2016冬',
        'g_2016_sum' => '多文化ぐんま2016夏',
        'g_2017_win' => '多文化ぐんま2017冬',
        'g_2017_sum' => '多文化ぐんま2017夏',
        'g_2018_win' => '多文化ぐんま2018冬',
        'g_2018_sum' => '多文化ぐんま2018夏',
        'g_2019_win' => '多文化ぐんま2019冬',
        'g_2019_sum' => '多文化ぐんま2019夏',
        'g_2020_sum' => '多文化ぐんま2020夏(オンライン)',
        'g_2022_sum' => '多文化ぐんま2022夏',
        'g_2023_win' => '多文化ぐんま2023冬',
        'g_2023_sum' => '多文化ぐんま2023夏',
        'g_2024_win' => '多文化ぐんま2024冬',
        'g_2024_win' => '多文化ぐんま2024夏',
    ],
    // しずおか
    '多文化しずおか' => [
        's_2013'     => '多文化しずおか2013',
        's_2015_win' => '多文化しずおか2015冬',
        's_2015_sum' => '多文化しずおか2015夏',
    ],
    // プサン
    '多文化プサン' => [
        'b_2010_win' => '多文化プサン2007',
        'b_2010_sum' => '多文化プサン2008',
        'b_2011'     => '多文化プサン2009',
        'b_2012'     => '多文化プサン2011',
        'b_2013'     => '多文化プサン2013',
        'b_2014'     => '多文化プサン2014',
        'b_2015_win' => '多文化プサン2015冬',
        'b_2015_sum' => '多文化プサン2015夏',
        'b_2016'     => '多文化プサン2016',
        'b_2017'     => '多文化プサン2017',
        'b_2018'     => '多文化プサン2018',
        'b_2019'     => '多文化プサン2019',
        'b_2023'     => '多文化プサン2023',
        'b_2023'     => '多文化プサン2024',
    ],
    // マラン
    '多文化マラン' => [
        'm_2007' => '多文化マラン2007',
        'm_2008' => '多文化マラン2008',
        'm_2009' => '多文化マラン2009',
        'm_2011' => '多文化マラン2011',
        'm_2012' => '多文化マラン2012',
        'm_2013' => '多文化マラン2013',
        'm_2014' => '多文化マラン2014',
        'm_2015' => '多文化マラン2015',
        'm_2016' => '多文化マラン2016',
        'm_2017' => '多文化マラン2017',
        'm_2018' => '多文化マラン2018',
        'm_2019' => '多文化マラン2019',
        'm_2024' => '多文化マラン2024',
    ],
    // オンライン
    '多文化オンライン(ぐんま×マラン×プサン)' => [
        'o_2021' => '多文化オンライン2021 ぐんま×マラン×プサン',
        'o_2022' => '多文化オンライン2022 ぐんま×マラン×プサン',
    ],
    // USA
    '多文化USA' => [
        'u_2014' => '多文化USA2014',
    ],
    // 台湾
    '多文化台湾' => [
        't_2007' => '多文化台湾2007 ',
        't_2008' => '多文化台湾2008',
    ],
    // 大人多文化
    '大人多文化' => [
        'a_2018' => '大人多文化2018',
    ],
    // ぐんまカップ
    'ぐんまカップ' => [
        'cup_1st'  => '第1回ぐんまカップ',
        'cup_2nd'  => '第2回ぐんまカップ',
    ],
];
