<?php

declare(strict_types=1);

return [
    'reset'           => 'パスワードが再設定されました。',
    'sent'            => 'パスワードリセットメールを送信しました。',
    'throttled'       => '時間を置いて再度お試しください。',
    'token'           => 'このパスワード再設定トークンは無効です。',
    'user'            => 'メールアドレスが違います。',
    'failed_regist_new'    => '登録に失敗しました。お手数ですが、再度お試しください。',
    'failed_send'     => '送信できませんでした。お手数ですが、再度お試しください。',
    'failed_regist_reset'     => '送信できませんでした。お手数ですが、再度お試しください。',
    'expired'         => 'URLの有効期限が過ぎたためエラーが発生しました。再度パスワード再設定手続きをお願いします。',
];
